[
    {
        "response": "I understand how frustrating it is to keep encountering login issues with SSO. It seems that the recent changes in our system may be affecting your login process.\n\nTo help you resolve this, I recommend trying the following steps:\n1. **Use a non-SSO Username**: You may need to enter a username associated with a non-SSO account first. This is a recent change and can help bypass the SSO redirect. You can follow the steps outlined in our article on [Logging Into a Customer Account with SSO Enabled](https://support.everstream.ai/hc/en-us/articles/23890706255885-Logging-Into-a-Customer-Account-with-SSO-Enabled).\n2. **Check Your Browser Settings**: If you're still having trouble, it could be related to browser settings. If you are using Microsoft Edge, make sure that third-party cookies are allowed, as blocking them could disrupt the login process. You can find more information about this in our article on [Test instance error while loading maps and Analytics dashboard](https://support.everstream.ai/hc/en-us/articles/23611053091853-Test-instance-error-while-loading-maps-or-Analytics-dashboard).\n3. **Clear Browser Cookies and Cache**: If the above steps don't work, clearing your browser's cookies and cache might help. Our article on [Getting logout page with message \"You have successfully logged out of Everstream\" after logging in](https://support.everstream.ai/hc/en-us/articles/23933474424461-Getting-logout-page-with-message-You-have-successfully-logged-out-of-Everstream-after-logging-in) provides guidance on how to clear these.\n\nIf you continue to experience this issue after trying these recommendations, please let me know. You can say \"I still need help,\" and provide your name, email address, and organization, and a customer support agent will get in touch with you shortly."
    },
    {
        "response": "Hi there! Welcome to the platform! I'm glad to help you understand how the risk scores are calculated.\n\nTo give you a better understanding, here are a couple of useful articles:\n1. **[Risk Scorecard - External Score Descriptions](https://support.everstream.ai/hc/en-us/articles/18585961484941-Risk-Scorecard-External-Score-Descriptions)** - This article provides descriptions of the risk scores used on the platform.\n2. **[Strategic Risk Scoring Definitions](https://support.everstream.ai/hc/en-us/articles/22581690927373-Strategic-Risk-Scoring-Definitions)** - Here, you can find the standard categories used for strategic risk scoring and the methodology behind the calculations.\n3. **[Best practices for risk scores and populating the Everstream Risk Scorecard](https://support.everstream.ai/hc/en-us/articles/25940065991053-Best-practices-for-risk-scores-and-populating-the-Everstream-Risk-Scorecard)** - This video explains the core concepts and best practices regarding risk scores, which might help clarify things further.\n\nIf you have any more questions or if there's something specific you'd like to know, just let me know! If you still need help, please feel free to respond with \"I still need help,\" along with your name, email address, and organization, and a customer support agent will reach out to you shortly. Happy to assist you!"
    },
    {
        "response": "I understand your concern about hurricanes and their impact. Unfortunately, I don't have specific information on when the next hurricane will hit North Carolina. However, we do have experts at Everstream who can provide the relevant insights you need.\n\nIf you'd like, you can say \"I need further help,\" and include your name, email address, and organization. A customer support agent will get in touch with you shortly to assist you further!"
    },
    {
        "response": "Sorry, I'm not able to help with anything else. Please create a support ticket and one of our CS team members will reach out to you."
    }
]